## Plan Result (stg_landing)




<pre><code>Plan: 12 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].azurerm_monitor_diagnostic_setting.shared_integration_datafactory
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;landing&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest00-meta002-stg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-raw&#34;]
* Update
  * module.logic[&#34;00&#34;].azurerm_resource_group_template_deployment.sqlConn
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_windows_virtual_machine.winvm[0]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow-F5-VPN-Inbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow-MoJ-RDP-Inbound&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_monitor_diagnostic_setting.shared_integration_datafactory will be created
  + resource "azurerm_monitor_diagnostic_setting" "shared_integration_datafactory" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.OperationalInsights/workspaces/ingest00-logAnalytics001-stg"
      + name                           = "shared-integration-datafactory-diag"
      + target_resource_id             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg"

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.shared_integration_datafactory_storage["landing"] will be created
  + resource "azurerm_role_assignment" "shared_integration_datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1d560979-d70e-41a1-b2dc-3b457e911249"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00landingstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.logic["00"].azurerm_resource_group_template_deployment.sqlConn will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "sqlConn" {
        id                       = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-logic-stg/providers/Microsoft.Resources/deployments/logicapp-sql-conn-deployment"
        name                     = "logicapp-sql-conn-deployment"
      ~ output_content           = jsonencode({}) -> (known after apply)
      ~ parameters_content       = jsonencode(
          ~ {
              - location   = {
                  - value = "uksouth"
                }
                # (1 unchanged attribute hidden)
            }
        )
        tags                     = {}
        # (5 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = false -> true
        id                                                     = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-stg"
        name                                                   = "ingest00-legacy-sql-stg"
        tags                                                   = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["nsg-Allow-F5-VPN-Inbound"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "rules" {
      + destination_address_prefix                 = "*"
      ~ destination_address_prefixes               = [
          - "10.247.23.0/24",
          - "10.247.24.0/24",
        ]
        id                                         = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-network-stg/providers/Microsoft.Network/networkSecurityGroups/ingest00-nsg-stg/securityRules/nsg-Allow-F5-VPN-Inbound"
        name                                       = "nsg-Allow-F5-VPN-Inbound"
        # (15 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["nsg-Allow-MoJ-RDP-Inbound"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "rules" {
      + destination_address_prefix                 = "*"
      ~ destination_address_prefixes               = [
          - "10.247.23.0/24",
          - "10.247.24.0/24",
        ]
        id                                         = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-network-stg/providers/Microsoft.Network/networkSecurityGroups/ingest00-nsg-stg/securityRules/nsg-Allow-MoJ-RDP-Inbound"
        name                                       = "nsg-Allow-MoJ-RDP-Inbound"
        # (15 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this["ingest00-meta002-stg"] will be created
  + resource "azurerm_data_factory_linked_service_key_vault" "this" {
      + data_factory_id          = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + key_vault_id             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg"
      + name                     = "ingest00-meta002-stg"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["keyvault"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-keyvault-stg"
      + subresource_name   = "vault"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.KeyVault/vaults/ingest00-meta002-stg"

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["landing-blob"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-landing-blob-stg"
      + subresource_name   = "blob"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00landingstg"

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["landing-dfs"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-stg"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-landing-dfs-stg"
      + subresource_name   = "dfs"
      + target_resource_id = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00landingstg"

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["keyvault"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["landing-blob"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["landing-dfs"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["mssql"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["storage-curated"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["storage-raw"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

Plan: 12 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":41,"Program":"tfcmt","SHA1":"","Target":"stg_landing","Vars":{}} -->